In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
#from scipy.stats import mode

In [57]:
train = pd.read_csv('F:/Data_Science/Datasets/Loan_Pred_train.csv')
train['source'] = 'train'
test = pd.read_csv('F:\Data_Science\Datasets\Loan_Pred_test.csv')
test['source'] = 'test'
print(train.shape)
print(test.shape)

(614, 14)
(367, 13)

In [58]:
df = pd.concat([train, test], ignore_index=True)
df.shape

(981, 14)

In [5]:
df.head()

,ApplicantIncome,CoapplicantIncome,Credit_History,Dependents,Education,Gender,LoanAmount,Loan_Amount_Term,Loan_ID,Loan_Status,Married,Property_Area,Self_Employed,source
0,5849,0.0,1.0,0,Graduate,Male,NaN,360.0,LP001002,Y,No,Urban,No,train
1,4583,1508.0,1.0,1,Graduate,Male,128.0,360.0,LP001003,N,Yes,Rural,No,train
2,3000,0.0,1.0,0,Graduate,Male,66.0,360.0,LP001005,Y,Yes,Urban,Yes,train
3,2583,2358.0,1.0,0,Not Graduate,Male,120.0,360.0,LP001006,Y,Yes,Urban,No,train
4,6000,0.0,1.0,0,Graduate,Male,141.0,360.0,LP001008,Y,No,Urban,No,train

In [6]:
df.describe()

,ApplicantIncome,CoapplicantIncome,Credit_History,LoanAmount,Loan_Amount_Term
count,981.000000,981.000000,902.000000,954.000000,961.000000
mean,5179.795107,1601.916330,0.835920,142.511530,342.201873
std,5695.104533,2718.772806,0.370553,77.421743,65.100602
min,0.000000,0.000000,0.000000,9.000000,6.000000
25%,2875.000000,0.000000,1.000000,100.000000,360.000000
50%,3800.000000,1110.000000,1.000000,126.000000,360.000000
75%,5516.000000,2365.000000,1.000000,162.000000,360.000000
max,81000.000000,41667.000000,1.000000,700.000000,480.000000

In [7]:
cat = df.dtypes[df.dtypes == 'object'].index
df[cat].describe()

,Dependents,Education,Gender,Loan_ID,Loan_Status,Married,Property_Area,Self_Employed,source
count,956,981,957,981,614,978,981,926,981
unique,4,2,2,981,2,2,3,2,2
top,0,Graduate,Male,LP001974,Y,Yes,Semiurban,No,train
freq,545,763,775,1,422,631,349,807,614

In [59]:
df.isnull().sum()

ApplicantIncome        0
CoapplicantIncome      0
Credit_History        79
Dependents            25
Education              0
Gender                24
LoanAmount            27
Loan_Amount_Term      20
Loan_ID                0
Loan_Status          367
Married                3
Property_Area          0
Self_Employed         55
source                 0
dtype: int64

In [27]:
df[(df['Married'] == 'Yes') & df['Dependents'].isnull()].count()

ApplicantIncome      13
CoapplicantIncome    13
Credit_History       12
Dependents            0
Education            13
Gender               13
LoanAmount           11
Loan_Amount_Term     12
Loan_ID              13
Loan_Status           8
Married              13
Property_Area        13
Self_Employed        13
source               13
dtype: int64

In [60]:
#Filling missing values of Married as 'Yes' where CoapplicantIncome == 0
miss_loc =(df['Married'].isnull()) & (df['CoapplicantIncome'] == 0)
print('Before', miss_loc.sum())
df.loc[miss_loc,'Married'] = df['Married'].fillna('No')
print('After', miss_loc.sum())

Before 2
After 2

In [75]:
#Imputing missing values for Gender based on coapplicant income lesser than applicantincome
miss_loc = ((df['ApplicantIncome'] > df['CoapplicantIncome']) & (df['CoapplicantIncome'] != 0) & (df['Gender'].isnull()))
print('No. of filled missing Gender ',miss_loc.sum())
df.loc[miss_loc,'Gender'] = df['Gender'].fillna('Male')
df['Gender'].isnull().sum()

No. of filled missing Gender  8

16

In [77]:
miss_loc = ((df['ApplicantIncome'] < df['CoapplicantIncome']) & (df['CoapplicantIncome'] != 0) & (df['Gender'].isnull()))
print('No. of filled missing Gender ',miss_loc.sum())
df.loc[miss_loc,'Gender'] = df['Gender'].fillna('Female')
df['Gender'].isnull().sum()

No. of filled missing Gender  6

10